
&НаСервере
Процедура ПриОткрытииНаСервере()
	Если Объект.ЭтапРаботы=Перечисления.ЭтапыРаботы.ДругойОтветственный тогда
		ЭтаФорма.Элементы.Ответственный.Видимость=Истина;
	КОнецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЭтапРаботыПриИзмененииНаСервере()
	Если Объект.ЭтапРаботы=Перечисления.ЭтапыРаботы.ДругойОтветственный тогда
		ЭтаФорма.Элементы.Ответственный.Видимость=Истина;
	Иначе 
		ЭтаФорма.Элементы.Ответственный.Видимость=Ложь;
	КОнецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапРаботыПриИзменении(Элемент)
	ЭтапРаботыПриИзмененииНаСервере();
КонецПроцедуры
